modm-ext/data.modm.io/docs/svd/header_stm32f412vx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN1">
      <name>CAN2</name>
      <description>Controller Area Network</description>
      <baseAddress>0x40006800</baseAddress>
      <interrupt>
        <name>CAN2_TX</name>
        <description>CAN2 TX Interrupt</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX0</name>
        <description>CAN2 RX0 Interrupt</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CAN2_RX1</name>
        <description>CAN2 RX1 Interrupt</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>CAN2_SCE</name>
        <description>CAN2 SCE Interrupt</description>
        <value>66</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <baseAddress>0x40007000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>PWR power control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPDS</name>
              <description>Low-Power Deepsleep</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>Voltage Regulator in main mode during deepsleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>Voltage Regulator in low-power mode during deepsleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDS</name>
              <description>Power Down Deepsleep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF</name>
              <description>Clear Wakeup Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSBF</name>
              <description>Clear Standby Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDE</name>
              <description>Power Voltage Detector Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>PLS[2:0] bits (PVD Level Selection)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <description>Voltage threshold detected by PVD 2.2 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <description>Voltage threshold detected by PVD 2.3 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <description>Voltage threshold detected by PVD 2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <description>Voltage threshold detected by PVD 2.5 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <description>Voltage threshold detected by PVD 2.6 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <description>Voltage threshold detected by PVD 2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <description>Voltage threshold detected by PVD 2.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <description>Voltage threshold detected by PVD 2.9 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable Backup Domain write protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FPDS</name>
              <description>Flash power down in Stop mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPLVDS</name>
              <description>Low Power Regulator Low Voltage in Deep Sleep mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MRLVDS</name>
              <description>Main Regulator Low Voltage in Deep Sleep mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCDC1</name>
              <description>Refer to AN4073 on how to use this bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOS</name>
              <description>VOS[1:0] bits (Regulator voltage scaling output selection)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMSSR</name>
              <description>Flash Memory Sleep System Run</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FISSR</name>
              <description>Flash Interface Stop while System Run</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>PWR power control/status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WUF</name>
              <description>Wakeup Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>Standby Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDO</name>
              <description>PVD Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRR</name>
              <description>Backup regulator ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP3</name>
              <description>Enable WKUP pin 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP2</name>
              <description>Enable WKUP pin 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP1</name>
              <description>Enable WKUP pin 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRE</name>
              <description>Backup regulator enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOSRDY</name>
              <description>Regulator voltage scaling output selection ready</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
